// // --створити масив з:
// // - з 5 числових значень
// // - з 5 стічкових значень
// // - з 5 значень стрічкового, числового та булевого типу
// // - та вивести його в консоль
// let mas = [
//     [1, 52, 69, 52, 87,],['gh', 'egfd', 'dgg', 'drtgdg', 'dfgdd'],[45, false, true, 'fdgvd', false]];
//     console.log(mas)
//
// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let masTwo = [];
// masTwo[0] = 'heloow';
// masTwo[1] = 'okten';
// console.log(masTwo);

// // // - є масив [2,17,13,6,22,31,45,66,100,-18] :
// // // 1. перебрати його циклом while
// let mas = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 0;
// while (i < mas.length) {
//     console.log(mas + [])
//     i++
// }

// //     2. перебрати його циклом for
// let mas = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for ( i=0; i<mas.length; i++){
//     console.log(mas +[])
// }

// // 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// // let mas = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 0;
// while (i<mas.length){
//     console.log(mas + [])
//     i++
// }


// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
let mas = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (i = 0; i < mas.length; i++) {
    if (mas[i] % !== 0)
        console.log(mas[i])
}
